tap "homebrew/bundle"

# Languages

## Haskell

brew "ghcup"
brew "hlint"

## PHP

brew "php@8.3"
brew "composer"

## Python

brew "python@3.9"
brew "python@3.10"

# CLI Utils

brew "awscli"
brew "direnv"
brew "eksctl"
brew "helm"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "nvm"
brew "postgresql"
brew "redis"
brew "unar"
brew "yt-dlp"
brew "zsh"
brew "ffmpeg"

# GUI Apps

cask "1password"
cask "1password-cli"
cask "audacity"
cask "blackhole-2ch"
cask "calibre"
cask "discord"
cask "docker"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "macvim"
cask "microsoft-office"
cask "microsoft-teams"
cask "nordvpn"
cask "obs"
cask "obs-websocket"
cask "pgadmin4"
cask "postman"
cask "roam-research"
cask "slack"
cask "spotify"
cask "steam"
cask "transmission"
cask "unity-hub"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# VS Code Extensions

vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-azuretools.vscode-docker"
vscode "elmtooling.elm-ls-vscode"
vscode "github.vscode-github-actions"
vscode "geequlim.godot-tools"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "lierdakil.haskell-build"
vscode "hoovercj.haskell-linter"
vscode "tim-koehler.helm-intellisense"
vscode "rusnasonov.vscode-hugo"
vscode "budparr.language-hugo-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vscode.makefile-tools"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "xdebug.php-debug"
vscode "bmewburn.vscode-intelephense-client"
vscode "ms-ossdata.vscode-postgresql"
vscode "stkb.rewrap"
vscode "vigoo.stylish-haskell"
vscode "netcorext.uuid-generator"
vscode "vscodevim.vim"
vscode "redhat.vscode-yaml"
