tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "python@3.10"
brew "awscli"
brew "php"
brew "composer"
brew "eksctl"
brew "python@3.9"
brew "haskell-stack"
brew "helm"
brew "httpie"
brew "jq"
brew "php@8.0"
brew "postgresql"
brew "unar"
brew "yt-dlp"
brew "zsh"
brew "ffmpeg"
cask "1password"
cask "1password-cli"
cask "audacity"
cask "blackhole-2ch"
cask "calibre"
cask "discord"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "macvim"
cask "nordvpn"
cask "obs"
cask "obs-virtualcam"
cask "obs-websocket"
cask "postman"
cask "slack"
cask "spotify"
cask "steam"
cask "transmission"
cask "unity-hub"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
